In [22]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [23]:
data_test = pd.read_csv('test.csv')
data_train = pd.read_csv('train.csv')
data_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
data_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [25]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [26]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
print(data_train.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [28]:
df = data_train[['Survived', 'Pclass', 'Sex', 'Age', 'SibSp','Parch', 'Ticket', 'Fare', 'Embarked']]
df.head(10)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,female,35.0,1,0,113803,53.1000,S
4,0,3,male,35.0,0,0,373450,8.0500,S
5,0,3,male,NaN,0,0,330877,8.4583,Q
6,0,1,male,54.0,0,0,17463,51.8625,S
7,0,3,male,2.0,3,1,349909,21.0750,S
8,1,3,female,27.0,0,2,347742,11.1333,S
9,1,2,female,14.0,1,0,237736,30.0708,C

In [29]:
print(df[df['Sex'] == 'male'].shape[0], df[df['Sex'] == 'female'].shape[0])

577 314

In [30]:
categories_ticket = df['Ticket'].unique()

def transformation(value):
    value_r = "numeric" if value.isnumeric() else value
    value_r = value_r.split(' ')[0]
    value_r = value_r.replace('.','').replace('/','').upper()[:2]
    return value_r

categories_2 = list(set([transformation(ele) for ele in categories_ticket]))
print(len(categories_ticket), len(categories_2))
print(categories_2)

681 18
['SC', 'CA', 'LI', 'A5', 'WC', 'ST', 'NU', 'A4', 'FC', 'PP', 'PC', 'SW', 'AS', 'FA', 'WE', 'C', 'SP', 'SO']

In [31]:
df['Ticket'] = df['Ticket'].apply(transformation)
new_categories = df['Ticket'].unique()
new_categories

C:\Users\lenovo\AppData\Local\Temp\ipykernel_5160\1729628985.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Ticket'] = df['Ticket'].apply(transformation)

array(['A5', 'PC', 'ST', 'NU', 'PP', 'CA', 'SC', 'A4', 'SP', 'SO', 'WC',
       'WE', 'C', 'FA', 'LI', 'FC', 'SW', 'AS'], dtype=object)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Ticket    891 non-null    object
 7   Fare      891 non-null    float64
 8   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [33]:
df['Age'] = df['Age'].fillna(df['Age'].median())
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df.head(10)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_5160\4262822185.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'] = df['Age'].fillna(df['Age'].median())
C:\Users\lenovo\AppData\Local\Temp\ipykernel_5160\4262822185.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

   Survived  Pclass     Sex   Age  SibSp  Parch Ticket     Fare Embarked
0         0       3    male  22.0      1      0     A5   7.2500        S
1         1       1  female  38.0      1      0     PC  71.2833        C
2         1       3  female  26.0      0      0     ST   7.9250        S
3         1       1  female  35.0      1      0     NU  53.1000        S
4         0       3    male  35.0      0      0     NU   8.0500        S
5         0       3    male  28.0      0      0     NU   8.4583        Q
6         0       1    male  54.0      0      0     NU  51.8625        S
7         0       3    male   2.0      3      1     NU  21.0750        S
8         1       3  female  27.0      0      2     NU  11.1333        S
9         1       2  female  14.0      1      0     NU  30.0708        C

In [34]:
df = pd.get_dummies(df, columns=['Sex','Ticket','Embarked'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 29 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    891 non-null    int64
 1   Pclass      891 non-null    int64
 2   Age         891 non-null    float64
 3   SibSp       891 non-null    int64
 4   Parch       891 non-null    int64
 5   Fare        891 non-null    float64
 6   Sex_female  891 non-null    bool
 7   Sex_male    891 non-null    bool
 8   Ticket_A4   891 non-null    bool
 9   Ticket_A5   891 non-null    bool
 10  Ticket_AS   891 non-null    bool
 11  Ticket_C    891 non-null    bool
 12  Ticket_CA   891 non-null    bool
 13  Ticket_FA   891 non-null    bool
 14  Ticket_FC   891 non-null    bool
 15  Ticket_LI   891 non-null    bool
 16  Ticket_NU   891 non-null    bool
 17  Ticket_PC   891 non-null    bool
 18  Ticket_PP   891 non-null    bool
 19  Ticket_SC   891 non-null    bool
 20  Ticket_SO   891 non-null    bool
 21  Ticket_SP   891 non-null    bool
 22  Ticket_ST   891 non-null    bool
 23  Ticket_SW   891 non-null    bool
 24  Ticket_WC   891 non-null    bool
 25  Ticket_WE   891 non-null    bool
 26  Embarked_C  891 non-null    bool
 27  Embarked_Q  891 non-null    bool
 28  Embarked_S  891 non-null    bool
dtypes: bool(23), float64(2), int64(4)
memory usage: 61.9 KB

In [35]:
numpy_dataset = df.values
print(numpy_dataset.shape)

(891, 29)

In [36]:
X, Y = numpy_dataset[:,1:], numpy_dataset[:, 0:1]
print(X.shape, Y.shape)

(891, 28) (891, 1)

In [37]:
def normalization(X):
    """
    Normalise uniquement les colonnes numériques (non-booléennes).
    Les colonnes booléennes restent inchangées.
    """
    X_normalized = X.copy().astype(float)
    _min = np.min(X, axis=0)
    _max = np.max(X, axis=0)
    
    # Éviter la division par zéro pour les colonnes constantes
    # Normaliser uniquement les colonnes où max != min
    mask = (_max - _min) != 0
    X_normalized[:, mask] = (X[:, mask] - _min[mask]) / (_max[mask] - _min[mask])
    
    return X_normalized, _min, _max

new_X, _min, _max = normalization(X)
print(_min, _max)

[1 0.42 0 0 0.0 False False False False False False False False False
 False False False False False False False False False False False False
 False False] [3 80.0 8 6 512.3292 True True True True True True True True True True
 True True True True True True True True True True True True True]

In [38]:
new_X

array([[1.        , 0.27117366, 0.125     , ..., 0.        , 0.        ,
        1.        ],
       [0.        , 0.4722292 , 0.125     , ..., 1.        , 0.        ,
        0.        ],
       [1.        , 0.32143755, 0.        , ..., 0.        , 0.        ,
        1.        ],
       ...,
       [1.        , 0.34656949, 0.125     , ..., 0.        , 0.        ,
        1.        ],
       [0.        , 0.32143755, 0.        , ..., 1.        , 0.        ,
        0.        ],
       [1.        , 0.39683338, 0.        , ..., 0.        , 1.        ,
        0.        ]])

In [39]:
def hypothesis(X, theta):
    X_ = np.concatenate([np.ones((X.shape[0], 1)), X], axis=1)
    Z = np.dot(X_, theta)
    Z = np.array(Z, dtype=np.float64)
    return 1 / (1 + np.exp(-Z))

theta_test = np.random.random((new_X.shape[1] + 1, 1))
print(hypothesis(X[:2,:], theta_test))

[[0.99998838]
 [1.        ]]

In [40]:
def cost(X, Y, theta):
    H = hypothesis(X, theta)
    Z = Y*np.log(H)+(1-Y)*np.log(1-H)
    return (-1/(X.shape[0]))*np.sum(Z)

print(cost(new_X, Y, theta_test))

1.3894453588068356

In [41]:
def gradient(X,Y,theta):
    H = hypothesis(X,theta)
    X_ = np.concatenate([np.ones((X.shape[0], 1)), X], axis=1)
    return (1/X.shape[0]) * np.dot(X_.T, H-Y)

print(gradient(new_X, Y, theta_test).shape)

(29, 1)

In [42]:
def accuracy(X,Y,theta):
    H = hypothesis(X, theta)
    pred = H > 0.5
    nb_good_prediction = np.sum(pred==Y)
    return 100*(nb_good_prediction/X.shape[0])

def gradient_descent(X,Y,lr, steps):
    theta_i = np.random.random((X.shape[1]+1,1))
    for i in range(steps):
        grad = gradient(X,Y,theta_i)
        theta_i = theta_i - lr*grad
        if i%10000 == 9999:
            print('Cost = ',cost(X,Y,theta_i), 'and accuracy = ', accuracy(X,Y,theta_i),' %')
    return theta_i

# Réduire le nombre d'itérations pour un test plus rapide (vous pouvez augmenter si nécessaire)
theta_r = gradient_descent(new_X,Y,1e-3,100000)

Cost =  0.50941453396588 and accuracy =  77.89001122334456  %
Cost =  0.48650654021999645 and accuracy =  78.45117845117845  %
Cost =  0.4771311824178323 and accuracy =  78.78787878787878  %
Cost =  0.47172966554218293 and accuracy =  78.67564534231201  %
Cost =  0.4680481809963982 and accuracy =  78.67564534231201  %
Cost =  0.4652837893072246 and accuracy =  78.90011223344557  %
Cost =  0.4630616379125525 and accuracy =  79.01234567901234  %
Cost =  0.46118184863418343 and accuracy =  78.90011223344557  %
Cost =  0.4595309875847626 and accuracy =  78.90011223344557  %
Cost =  0.4580422993607709 and accuracy =  78.90011223344557  %